Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [3]:
# Answer 1: 
# Given list is [4, 8, 15, 16, 23, 42]
import pandas as pd 
df=pd.Series([4, 8, 15, 16, 23, 42])
df

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [3]:
# Answer 2: 
# Created a list 'var'
import pandas as pd
var=[1,2,3,4,5,6,7,8,9,10]
df=pd.Series(var)  # created a Seires
df

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data. Then, print the DataFrame.

In [4]:
# Answer 3:
# Created the given DataFrame
import pandas as pd
data=[["Alice", 25, "Female"], ["Bob", 30, "Male"], ["Claire", 27, "Female"]]
df=pd.DataFrame(data, columns=["Name", "Age", "Gender"])     
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Answer 4: In pandas, a DataFrame is a two-dimensional labeled data structure, which is similar to a table in a relational database or a spreadsheet. It consists of rows and columns, where each column can have a different data type (such as integer, float, or string), and each row represents a unique observation or record.
On the other hand, a pandas Series is a one-dimensional labeled array that can hold data of any type. It can be thought of as a column in a DataFrame, where each element of the Series has a label or index that can be used to retrieve or modify its value.

In [6]:
# An example of Series and DataFrame
list1=["Rohita", "Meenakshi", "Reema", "Lata"]
list2=[["Rohita", 16, 11], ["Meenakshi", 7, 2], ["Reema", 9, 4], ["Lata", 10, 5]]
df_list1=pd.Series(list1)
df_list2=pd.DataFrame(list2, columns=["Name", "Age", "Class"])
print("My series is:\n", df_list1)
print("My dataframe is:\n", df_list2)

My series is:
 0       Rohita
1    Meenakshi
2        Reema
3         Lata
dtype: object
My dataframe is:
         Name  Age  Class
0     Rohita   16     11
1  Meenakshi    7      2
2      Reema    9      4
3       Lata   10      5

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

Answer 5: 

head(n) and tail(n): to view the first or last n rows of the DataFrame, respectively.
Example: df.head(10) to view the first 10 rows of the DataFrame.

describe(): to generate descriptive statistics of the numerical columns in the DataFrame.
Example: df.describe() to view the count, mean, standard deviation, minimum, maximum, and quartile values of the numerical columns.

info(): to display information about the DataFrame, such as the number of rows and columns, data types, and memory usage.
Example: df.info() to view the information about the DataFrame.

value_counts(): to count the occurrences of unique values in a column of the DataFrame.
Example: df['gender'].value_counts() to count the number of males and females in the gender column.

groupby(): to group the data in the DataFrame by one or more columns and apply a function to each group.
Example: df.groupby('gender')['salary'].mean() to calculate the mean salary for each gender.

sort_values(): to sort the DataFrame by one or more columns.
Example: df.sort_values(by='salary', ascending=False) to sort the DataFrame by salary in descending order.

drop(): to remove rows or columns from the DataFrame.
Example: df.drop(columns=['age']) to remove the age column from the DataFrame.

fillna(): to fill missing values in the DataFrame with a specified value or method.
Example: df.fillna(method='ffill') to fill missing values with the previous non-missing value.Rege

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Answer 6: Both Series and DataFrame are mutable in nature, while Panel is deprecated and no longer recommended to be used in Pandas.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [6]:
# Answer 7: 
import pandas as pd
# Created DataFrame using different Series
name=pd.Series(["Rohita", "Meenakshi", "Reema", "Lata"])
age=pd.Series([16, 7, 9, 10])
Class=pd.Series([11, 2, 4, 5])
data={"Name": name, "Class": Class, "Age": age}
df= pd.DataFrame(data)
df

        Name  Class  Age
0     Rohita     11   16
1  Meenakshi      2    7
2      Reema      4    9
3       Lata      5   10